config.org
#+title: Doom Emacs Configuration
#+author: Zhenkai Weng
#+startup: hideblocks overview
#+property: header-args :emacs-lisp :tangle no :noweb yes :cache yes :results silent :comments link :exports code

* Learn Emacs Lisp
- [[https://bzg.fr/en/learn-emacs-lisp-in-15-minutes.html/][Learn Emacs Lisp in 15 minutes · Bastien Guerry - Informatique et liberté]]
- [[http://steve-yegge.blogspot.com/2008/01/emergency-elisp.html][Stevey's Blog Rants: Emergency Elisp]]
- Emacs docs (=SPC h i= and search for "Emacs Lisp Intro")
- [[https://blog.aaronbieber.com/2015/08/04/authoring-emacs-packages.html][Authoring Emacs Packages - The Chronicle]]
* Install Doom Emacs
To install Doom Emacs, run
: git clone --depth 1 https://github.com/hlissner/doom-emacs ~/.emacs.d && cd ~/.emacs.d && bin/doom install
After adding =~/.emacs.d/bin= to your =$PATH=...
- ~doom sync~ when you change =init.el= or =packages.el=
- ~doom purge~ to remove unnecessary packages
- ~doom upgrade~ to upgrade Doom itself and all packages installed
- ~doom build~ to byte-compile packages
- ~doom help [command]~ to view additional commands or to view usage of =command=
* Doom Modules
The =init.el= file specifies what Doom modules I use. Doom modules are basically packages nicely integrated into Doom Emacs, often defining evil-mode keybindings for commonly used commands.
** =doom!=
#+name: doom-init
#+begin_src emacs-lisp :tangle "~/.doom.d/init.el" :noweb yes
;;; init.el -*- lexical-binding: t; -*-
(doom! :input
       <<doom-input>>

       :completion
       <<doom-completion>>

       :ui
       <<doom-ui>>

       :editor
       <<doom-editor>>

       :emacs
       <<doom-emacs>>

       :term
       <<doom-term>>

       :checkers
       <<doom-checkers>>

       :tools
       <<doom-tools>>

       :os
       <<doom-os>>

       :lang
       <<doom-lang>>

       :email
       <<doom-email>>

       :app
       <<doom-app>>

       :config
       <<doom-config>>

       )
#+end_src
** =:input=
Fcitx integration, improved spacing, and kana search functionality (I don't use the IMEs though).
#+name: doom-input
#+begin_src elisp :tangle no
chinese
japanese
#+end_src
** =:completion=
#+name: doom-completion
#+begin_src elisp :tangle no
(company +childframe)          ; the ultimate code completion backend
;;helm                         ; the *other* search engine for love and life
;;ido                          ; the other *other* search engine...
(ivy +prescient +fuzzy +icons) ; a search engine for love and life
#+end_src
** =:ui=
#+name: doom-ui
#+begin_src elisp :tangle no
;;deft                         ; notational velocity for Emacs
doom                           ; what makes DOOM look the way it does
doom-dashboard                 ; a nifty splash screen for Emacs
doom-quit                      ; DOOM quit-message prompts when you quit Emacs
;;(emoji +unicode)             ; 🙂
hl-todo                        ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
;;hydra
;;indent-guides                ; highlighted indent columns
(ligatures +extra)             ; ligatures or substitute text with pretty symbols
;;minimap                      ; show a map of the code on the side
modeline                       ; snazzy, Atom-inspired modeline, plus API
nav-flash                      ; blink cursor line after big motions
;;neotree                      ; a project drawer, like NERDTree for vim
ophints                        ; highlight the region an operation acts on
(popup +all +defaults)         ; tame sudden yet inevitable temporary windows
;;tabs                         ; an tab bar for Emacs
treemacs                       ; a project drawer, like neotree but cooler
unicode                        ; extended unicode support for various languages
(vc-gutter +diff-hl +pretty)   ; vcs diff in the fringe
vi-tilde-fringe                ; fringe tildes to mark beyond EOB
(window-select +numbers)       ; visually switch windows
workspaces                     ; tab emulation, persistence & separate workspaces
zen                            ; distraction-free coding or writing
#+end_src
** =:editor=
#+name: doom-editor
#+begin_src elisp :tangle no
(evil +everywhere)             ; come to the dark side, we have cookies
file-templates                 ; auto-snippets for empty files
fold                           ; (nigh) universal code folding
format                         ; automated prettiness
;;god                          ; run Emacs commands without modifier keys
;;lispy                        ; vim for lisp, for people who don't like vim
multiple-cursors               ; editing in many places at once
;;objed                        ; text object editing for the innocent
;;parinfer                     ; turn lisp into python, sort of
rotate-text                    ; cycle region at point between text candidates
snippets                       ; my elves. They type so I don't have to
;;word-wrap                    ; soft wrapping with language-aware indent
#+end_src
** =:emacs=
#+name: doom-emacs
#+begin_src elisp :tangle no
(dired +icons)         ; making dired pretty [functional]
electric                       ; smarter, keyword-based electric-indent
(ibuffer +icons)               ; interactive buffer management
undo                           ; persistent, smarter undo for your inevitable mistakes
vc                             ; version-control and Emacs, sitting in a tree
#+end_src
** =:term=
#+name: doom-term
#+begin_src elisp :tangle no
eshell                         ; the elisp shell that works everywhere
;;shell                        ; simple shell REPL for Emacs
;;term                         ; basic terminal emulator for Emacs
vterm                          ; the best terminal emulation in Emacs
#+end_src
** =:checkers=
#+name: doom-checkers
#+begin_src elisp :tangle no
;;syntax                       ; tasing you for every semicolon you forget
(spell +aspell)                ; tasing you for misspelling mispelling
;;grammar                      ; tasing grammar mistake every you make
#+end_src
** =:tools=
#+name: doom-tools
#+begin_src elisp :tangle no
;;ansible
;;(debugger +lsp)              ; FIXME stepping through code, to help you add bugs
;;direnv
(docker +lsp)
editorconfig                   ; let someone else argue about tabs vs spaces
;;ein                          ; tame Jupyter notebooks with emacs
(eval +overlay)                ; run code, run (also, repls)
;;gist                         ; interacting with github gists
(lookup +dictionary +offline)  ; navigate your code and its documentation
(lsp +peek)
(magit +forge)                 ; a git porcelain for Emacs
make                           ; run make tasks from Emacs
;;(pass +auth)                 ; password manager for nerds
pdf                            ; pdf enhancements
;;prodigy                      ; FIXME managing external services & code builders
rgb                            ; creating color strings
;;taskrunner                   ; taskrunner for all your projects
;;terraform                    ; infrastructure as code
;;tmux                         ; an API for interacting with tmux
tree-sitter                    ; syntax and parsing, sitting in a tree...
;;upload                       ; map local to remote projects via ssh/ftp
biblio
#+end_src
** =:os=
#+name: doom-os
#+begin_src elisp :tangle no
(:if IS-MAC macos)             ; improve compatibility with macOS
(tty +osc)                     ; improve the terminal Emacs experience
#+end_src
** =:lang=
#+name: doom-lang
#+begin_src elisp :tangle no
;;agda                         ; types of types of types of types...
;;beancount                    ; mind the GAAP
(cc +lsp)                      ; C/C++/Obj-C madness
;;clojure                      ; java with a lisp
;;common-lisp                  ; if you've seen one lisp, you've seen them all
;;coq                          ; proofs-as-programs
;;crystal                      ; ruby at the speed of c
;;csharp                       ; unity, .NET, and mono shenanigans
data                           ; config/data formats
;;(dart +flutter)              ; paint ui and not much else
;;dhall
;;elixir                       ; erlang done right
;;elm                          ; care for a cup of TEA?
emacs-lisp                     ; drown in parentheses
;;erlang                       ; an elegant language for a more civilized age
;;ess                          ; emacs speaks statistics
;;factor
;;faust                        ; dsp, but you get to keep your soul
;;fsharp                       ; ML stands for Microsoft's Language
;;fstar                        ; (dependent) types and (monadic) effects and Z3
;;gdscript                     ; the language you waited for
;;(go +lsp)                    ; the hipster dialect
;;(haskell +dante)             ; a language that's lazier than I am
;;hy                           ; readability of scheme w/ speed of python
;;idris                        ; support for the idris language
(json +lsp)                    ; At least it ain't XML
(java +meghanada)              ; the poster child for carpal tunnel syndrome
(javascript +lsp)              ; all(hope(abandon(ye(who(enter(here))))))
;;julia                        ; a better, faster MATLAB
;;kotlin                       ; a better, slicker Java(Script)
(latex +cdlatex +fold +lsp)    ; writing papers in Emacs has never been so fun
;;lean
;;ledger                       ; an accounting system in Emacs
;;lua                          ; one-based indices? one-based indices
(markdown +grip)               ; writing docs for people to ignore
;;nim                          ; python + lisp at the speed of c
;;nix                          ; I hereby declare "nix geht mehr!"
;;ocaml                        ; an objective camel
(org +pretty +dragndrop +journal +roam2 +pomodoro +journal +hugo +gnuplot) ; organize your plain life in plain text
php                            ; perl's insecure younger brother
;;plantuml                     ; diagrams for confusing people more
;;purescript                   ; javascript, but functional
(python +lsp +tree-sitter +pyright) ; beautiful is better than ugly
;;qt                           ; the 'cutest' gui framework ever
;;racket                       ; a DSL for DSLs
;;raku                         ; the artist formerly known as perl6
;;rest                         ; Emacs as a REST client
;;rst                          ; ReST in peace
;;(ruby +rails)                ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
(rust +lsp)                    ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
;;scala                        ; java, but good
;;scheme                       ; a fully conniving family of lisps
(sh +lsp +fish +powershell)    ; she sells {ba,z,fi}sh shells on the C xor
;;sml
;;solidity                     ; do you need a blockchain? No.
;;swift                        ; who asked for emoji variables?
;;terra                        ; Earth and Moon in alignment for performance.
web                            ; the tubes
yaml                           ; JSON, but readable
;;zig                          ; C, but simpler
#+end_src
** =:email=
#+name: doom-email
#+begin_src elisp :tangle no
;;(mu4e +org +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src
** =:app=
#+name: doom-app
#+begin_src elisp :tangle no
calendar
;;emms
;;everywhere                   ; *leave* Emacs!? You must be joking
;;irc                          ; how neckbeards socialize
;;(rss +org)                   ; emacs as an RSS reader
;;twitter                      ; twitter client https://twitter.com/vnought
#+end_src
** =:config=
I use literate config so that I can navigate (~counsel-org-goto~) and organize my Emacs configuration easily.
#+name: doom-config
#+begin_src elisp :tangle no
literate
(default +bindings +smartparens)
#+end_src
* External Packages
The =packages.el= file allows you to install external packages from MELPA or from any other sources using straight.el
#+begin_src emacs-lisp :tangle "~/.doom.d/packages.el"
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
<<doom-pkgs-fmt>>
<<doom-pkgs-org>>
<<doom-pkgs-misc>>
#+end_src
** File Formats
#+name: doom-pkgs-fmt
#+begin_src elisp :tangle no
(package! i3wm-config
  :recipe (:host github
           :repo "Alexander-Miller/i3wm-Config-Mode"))
(package! systemd)
(package! ssh-config-mode)
(package! protobuf-mode)
(package! vimrc-mode)
(package! ldap-mode)
(package! visual-basic-mode
  :recipe (:local-repo "visual-basic-mode.el"))
#+end_src
** Org-mode Related
#+name: doom-pkgs-org
#+begin_src elisp :tangle no
(unpin! org-mode)
(unpin! org-roam)
(package! org-super-agenda)
(package! org-edna)
(package! org-gcal)
;; (package! org-roam)
(package! org-roam-ui)
(package! org-roam-bibtex)
(package! org-transclusion
  :recipe (:host github :repo "nobiot/org-transclusion"))
;; dependency of delve
(package! lister
  :recipe (:host github :repo "publicimageltd/lister"))
(package! delve
  :recipe (:host github :repo "publicimageltd/delve"))
(package! org-ref)
(package! ivy-bibtex)
(package! parsebib
  :recipe
  (:files ("*.el"))) ; HACK: straight isn't building correctly somehow
(package! mathpix.el
  :recipe (:host github :repo "jethrokuan/mathpix.el"))
(package! org-analyzer)
(package! org-fancy-priorities)
(package! org-tanglesync)
(package! ob-mermaid)
#+end_src
** Miscellaneous
#+name: doom-pkgs-misc
#+begin_src elisp :tangle no
(package! epc) ; for some reason it's missing; installing manually here
(package! wgrep-ag)
(package! evil-matchit)
(package! calctex
  :recipe (:host github
           :repo "johnbcoughlin/calctex"
           :files ("*.el" "calctex/*.el" "calctex-contrib/*.el" "org-calctex/*.el")))
(package! elcord)
(package! ascii-art-to-unicode)
(package! nov)
(package! openwith)
(package! esup)
#+end_src
* Basic Customization
** Enable lexical binding
#+begin_src emacs-lisp :tangle yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src
** Helper functions
#+begin_src emacs-lisp :tangle yes
(defun file-contents (filename)
  "Return the contents of FILENAME."
  (with-temp-buffer
    (insert-file-contents filename)
    (buffer-string)))

(require 'f)
(defun get-org-template (name)
  (file-contents (f-join doom-private-dir "template" (concat name ".org"))))
#+end_src
** Secrets
#+begin_src emacs-lisp :tangle yes
(load-file (expand-file-name "secrets.el" doom-private-dir))
#+end_src
